
## Plan Result (prod)




### :warning: Resource Deletion will happen
This plan contains resource delete operation. Please check the plan result very carefully!

<pre><code>Plan: 18 to add, 5 to change, 8 to destroy.</code></pre>

* Create
  * azurerm_managed_disk.mig-01-disk[0]
  * azurerm_managed_disk.migration_os[0]
  * azurerm_role_assignment.storage_owner_quarantine[0]
  * azurerm_role_assignment.storage_owner_standard[0]
  * module.postgresql_flexible[0].azurerm_postgresql_flexible_server_database.pg_databases[&#34;psql-prod-darts-replica&#34;]
  * module.postgresql_flexible[0].azurerm_postgresql_flexible_server_database.pg_databases[&#34;psql-prod-dartsmig-01&#34;]
  * module.postgresql_flexible[0].azurerm_postgresql_flexible_server_database.pg_databases[&#34;psql-prod-detsmig-01&#34;]
  * module.sa.time_rotating.rotate
  * module.sa-migration-quarantine[0].time_rotating.rotate
  * module.sa-migration-standard[0].time_rotating.rotate
* Update
  * azurerm_logic_app_standard.logic[0]
  * azurerm_managed_disk.shared_disk[0]
  * azurerm_managed_disk.shared_disk_backup[0]
  * module.sa.azurerm_storage_account.storage_account
  * module.sa-migration-standard[0].azurerm_storage_account.storage_account
* Replace
  * module.application_insights.azurerm_monitor_activity_log_alert.main[0]
  * module.postgresql_flexible[0].azurerm_postgresql_flexible_server_active_directory_administrator.pgsql_adadmin
  * module.postgresql_flexible[0].null_resource.set-user-permissions-additionaldbs[&#34;psql-prod-darts-replica&#34;]
  * module.postgresql_flexible[0].null_resource.set-user-permissions-additionaldbs[&#34;psql-prod-dartsmig-01&#34;]
  * module.postgresql_flexible[0].null_resource.set-user-permissions-additionaldbs[&#34;psql-prod-detsmig-01&#34;]
  * module.sa.time_static.pim_expiry
  * module.sa-migration-quarantine[0].time_static.pim_expiry
  * module.sa-migration-standard[0].time_static.pim_expiry


<details><summary>Change Result (Click me)</summary>

```hcl

  # azurerm_logic_app_standard.logic[0] will be updated in-place
  ~ resource "azurerm_logic_app_standard" "logic" {
      ~ app_settings                             = {
          - "FUNCTIONS_WORKER_RUNTIME" = "dotnet" -> null
        }
        id                                       = "/subscriptions/5ca62022-6aa2-4cee-aaa7-e7536c8d566c/resourceGroups/darts-migration-prod-rg/providers/Microsoft.Web/sites/darts-migration-logic-prod"
        name                                     = "darts-migration-logic-prod"
        tags                                     = {
            "application"         = "darts"
            "builtFrom"           = "https://github.com/HMCTS/darts-shared-infrastructure.git"
            "businessArea"        = "Cross-Cutting"
            "contactSlackChannel" = "#darts-devs"
            "environment"         = "production"
            "managedBy"           = "Darts Modernisation"
        }
        # (24 unchanged attributes hidden)

        # (2 unchanged blocks hidden)
    }

  # azurerm_managed_disk.mig-01-disk[0] will be created
  + resource "azurerm_managed_disk" "mig-01-disk" {
      + create_option                     = "Empty"
      + disk_iops_read_only               = (known after apply)
      + disk_iops_read_write              = (known after apply)
      + disk_mbps_read_only               = (known after apply)
      + disk_mbps_read_write              = (known after apply)
      + disk_size_gb                      = 20000
      + id                                = (known after apply)
      + location                          = "uksouth"
      + logical_sector_size               = (known after apply)
      + max_shares                        = 2
      + name                              = "migration-shared-disk"
      + network_access_policy             = "AllowAll"
      + optimized_frequent_attach_enabled = false
      + performance_plus_enabled          = false
      + public_network_access_enabled     = true
      + resource_group_name               = "darts-migration-prod-rg"
      + source_uri                        = (known after apply)
      + storage_account_type              = "Premium_LRS"
      + tier                              = (known after apply)
    }

  # azurerm_managed_disk.migration_os[0] will be created
  + resource "azurerm_managed_disk" "migration_os" {
      + create_option                     = "Empty"
      + disk_iops_read_only               = (known after apply)
      + disk_iops_read_write              = (known after apply)
      + disk_mbps_read_only               = (known after apply)
      + disk_mbps_read_write              = (known after apply)
      + disk_size_gb                      = 20
      + id                                = (known after apply)
      + location                          = "uksouth"
      + logical_sector_size               = (known after apply)
      + max_shares                        = (known after apply)
      + name                              = "migration-osdisk"
      + network_access_policy             = "AllowAll"
      + optimized_frequent_attach_enabled = false
      + performance_plus_enabled          = false
      + public_network_access_enabled     = true
      + resource_group_name               = "darts-migration-prod-rg"
      + source_uri                        = (known after apply)
      + storage_account_type              = "Standard_LRS"
      + tags                              = {
          + "application"         = "darts"
          + "builtFrom"           = "https://github.com/HMCTS/darts-shared-infrastructure.git"
          + "businessArea"        = "Cross-Cutting"
          + "contactSlackChannel" = "#darts-devs"
          + "environment"         = "production"
          + "managedBy"           = "Darts Modernisation"
        }
      + tier                              = (known after apply)
    }

  # azurerm_managed_disk.shared_disk[0] will be updated in-place
  ~ resource "azurerm_managed_disk" "shared_disk" {
        id                                = "/subscriptions/5ca62022-6aa2-4cee-aaa7-e7536c8d566c/resourceGroups/darts-migration-prod-rg/providers/Microsoft.Compute/disks/shared-disk"
        name                              = "shared-disk"
      ~ tags                              = {
          - "application"  = "darts" -> null
          - "builtFrom"    = "https://github.com/HMCTS/darts-shared-infrastructure.git" -> null
          - "businessArea" = "Cross-Cutting" -> null
          - "environment"  = "production" -> null
        }
        # (31 unchanged attributes hidden)
    }

  # azurerm_managed_disk.shared_disk_backup[0] will be updated in-place
  ~ resource "azurerm_managed_disk" "shared_disk_backup" {
        id                                = "/subscriptions/5ca62022-6aa2-4cee-aaa7-e7536c8d566c/resourceGroups/darts-migration-prod-rg/providers/Microsoft.Compute/disks/shared-disk-backup"
        name                              = "shared-disk-backup"
      ~ tags                              = {
          - "application"  = "darts" -> null
          - "builtFrom"    = "https://github.com/HMCTS/darts-shared-infrastructure.git" -> null
          - "businessArea" = "Cross-Cutting" -> null
          - "environment"  = "production" -> null
        }
        # (31 unchanged attributes hidden)
    }

  # azurerm_role_assignment.storage_owner_quarantine[0] will be created
  + resource "azurerm_role_assignment" "storage_owner_quarantine" {
      + condition_version                = (known after apply)
      + id                               = (known after apply)
      + name                             = (known after apply)
      + principal_id                     = "aee94636-8387-4a51-b5a7-a96e580a32d7"
      + principal_type                   = (known after apply)
      + role_definition_id               = (known after apply)
      + role_definition_name             = "Owner"
      + scope                            = "/subscriptions/5ca62022-6aa2-4cee-aaa7-e7536c8d566c/resourceGroups/darts-migration-prod-rg/providers/Microsoft.Storage/storageAccounts/saproddartsquarantine"
      + skip_service_principal_aad_check = (known after apply)
    }

  # azurerm_role_assignment.storage_owner_standard[0] will be created
  + resource "azurerm_role_assignment" "storage_owner_standard" {
      + condition_version                = (known after apply)
      + id                               = (known after apply)
      + name                             = (known after apply)
      + principal_id                     = "aee94636-8387-4a51-b5a7-a96e580a32d7"
      + principal_type                   = (known after apply)
      + role_definition_id               = (known after apply)
      + role_definition_name             = "Owner"
      + scope                            = "/subscriptions/5ca62022-6aa2-4cee-aaa7-e7536c8d566c/resourceGroups/darts-migration-prod-rg/providers/Microsoft.Storage/storageAccounts/saproddartsmig02"
      + skip_service_principal_aad_check = (known after apply)
    }

  # module.application_insights.azurerm_monitor_activity_log_alert.main[0] must be replaced
-/+ resource "azurerm_monitor_activity_log_alert" "main" {
      ~ id                  = "/subscriptions/5ca62022-6aa2-4cee-aaa7-e7536c8d566c/resourceGroups/darts-prod-rg/providers/Microsoft.Insights/activityLogAlerts/Application Insights daily cap reached - darts-prod" -> (known after apply)
      ~ name                = "Application Insights daily cap reached - darts-prod" -> "Application-Insights-daily-cap-reached-darts-prod" # forces replacement
        tags                = {
            "application"         = "darts"
            "builtFrom"           = "https://github.com/HMCTS/darts-shared-infrastructure.git"
            "businessArea"        = "Cross-Cutting"
            "contactSlackChannel" = "#darts-devs"
            "environment"         = "production"
            "managedBy"           = "Darts Modernisation"
        }
        # (5 unchanged attributes hidden)

      ~ criteria {
          - levels                  = [] -> null
          - resource_groups         = [] -> null
          - resource_ids            = [] -> null
          - resource_providers      = [] -> null
          - resource_types          = [] -> null
          - statuses                = [] -> null
          - sub_statuses            = [] -> null
            # (13 unchanged attributes hidden)

          ~ resource_health (known after apply)

          ~ service_health (known after apply)
        }

        # (1 unchanged block hidden)
    }

  # module.postgresql_flexible[0].azurerm_postgresql_flexible_server_active_directory_administrator.pgsql_adadmin must be replaced
-/+ resource "azurerm_postgresql_flexible_server_active_directory_administrator" "pgsql_adadmin" {
      ~ id                  = "/subscriptions/5ca62022-6aa2-4cee-aaa7-e7536c8d566c/resourceGroups/darts-migration-prod-rg/providers/Microsoft.DBforPostgreSQL/flexibleServers/darts-migration-prod/administrators/4d0554dd-fe60-424a-be9c-36636826d927" -> (known after apply)
      ~ object_id           = "4d0554dd-fe60-424a-be9c-36636826d927" -> "ef17f368-0aa5-43d5-9264-28080f83755e" # forces replacement
      ~ principal_name      = "DTS Platform Operations SC" -> "DTS Platform Operations PostgreSQL Admin Access SC" # forces replacement
        # (4 unchanged attributes hidden)
    }

  # module.postgresql_flexible[0].azurerm_postgresql_flexible_server_database.pg_databases["psql-prod-darts-replica"] will be created
  + resource "azurerm_postgresql_flexible_server_database" "pg_databases" {
      + charset   = "utf8"
      + collation = "en_GB.utf8"
      + id        = (known after apply)
      + name      = "psql-prod-darts-replica"
      + server_id = "/subscriptions/5ca62022-6aa2-4cee-aaa7-e7536c8d566c/resourceGroups/darts-migration-prod-rg/providers/Microsoft.DBforPostgreSQL/flexibleServers/darts-migration-prod"
    }

  # module.postgresql_flexible[0].azurerm_postgresql_flexible_server_database.pg_databases["psql-prod-dartsmig-01"] will be created
  + resource "azurerm_postgresql_flexible_server_database" "pg_databases" {
      + charset   = "utf8"
      + collation = "en_GB.utf8"
      + id        = (known after apply)
      + name      = "psql-prod-dartsmig-01"
      + server_id = "/subscriptions/5ca62022-6aa2-4cee-aaa7-e7536c8d566c/resourceGroups/darts-migration-prod-rg/providers/Microsoft.DBforPostgreSQL/flexibleServers/darts-migration-prod"
    }

  # module.postgresql_flexible[0].azurerm_postgresql_flexible_server_database.pg_databases["psql-prod-detsmig-01"] will be created
  + resource "azurerm_postgresql_flexible_server_database" "pg_databases" {
      + charset   = "utf8"
      + collation = "en_GB.utf8"
      + id        = (known after apply)
      + name      = "psql-prod-detsmig-01"
      + server_id = "/subscriptions/5ca62022-6aa2-4cee-aaa7-e7536c8d566c/resourceGroups/darts-migration-prod-rg/providers/Microsoft.DBforPostgreSQL/flexibleServers/darts-migration-prod"
    }

  # module.postgresql_flexible[0].null_resource.set-user-permissions-additionaldbs["psql-prod-darts-replica"] must be replaced
-/+ resource "null_resource" "set-user-permissions-additionaldbs" {
      ~ id       = "154290820805208931" -> (known after apply)
      ~ triggers = { # forces replacement
          + "db_reader_schemas" = "public"
          ~ "script_hash"       = "dbe0102f3129d4463913d5e01177e806bc6954005bdd98f20c242658634a1bbc" -> "88abfc1a97fc27a8f4d01362525f3b65e85409d3a475ecc79b11ad09a019e469"
            # (3 unchanged elements hidden)
        }
    }

  # module.postgresql_flexible[0].null_resource.set-user-permissions-additionaldbs["psql-prod-dartsmig-01"] must be replaced
-/+ resource "null_resource" "set-user-permissions-additionaldbs" {
      ~ id       = "4619313056984336138" -> (known after apply)
      ~ triggers = { # forces replacement
          + "db_reader_schemas" = "public"
          ~ "script_hash"       = "dbe0102f3129d4463913d5e01177e806bc6954005bdd98f20c242658634a1bbc" -> "88abfc1a97fc27a8f4d01362525f3b65e85409d3a475ecc79b11ad09a019e469"
            # (3 unchanged elements hidden)
        }
    }

  # module.postgresql_flexible[0].null_resource.set-user-permissions-additionaldbs["psql-prod-detsmig-01"] must be replaced
-/+ resource "null_resource" "set-user-permissions-additionaldbs" {
      ~ id       = "8499794368887057423" -> (known after apply)
      ~ triggers = { # forces replacement
          + "db_reader_schemas" = "public"
          ~ "script_hash"       = "dbe0102f3129d4463913d5e01177e806bc6954005bdd98f20c242658634a1bbc" -> "88abfc1a97fc27a8f4d01362525f3b65e85409d3a475ecc79b11ad09a019e469"
            # (3 unchanged elements hidden)
        }
    }

  # module.sa.azurerm_storage_account.storage_account will be updated in-place
  ~ resource "azurerm_storage_account" "storage_account" {
        id                                 = "/subscriptions/5ca62022-6aa2-4cee-aaa7-e7536c8d566c/resourceGroups/darts-prod-rg/providers/Microsoft.Storage/storageAccounts/dartssaprod"
        name                               = "dartssaprod"
        tags                               = {
            "application"         = "darts"
            "builtFrom"           = "https://github.com/HMCTS/darts-shared-infrastructure.git"
            "businessArea"        = "Cross-Cutting"
            "contactSlackChannel" = "#darts-devs"
            "environment"         = "production"
            "managedBy"           = "Darts Modernisation"
        }
        # (97 unchanged attributes hidden)

      + network_rules {
          + bypass         = [
              + "AzureServices",
            ]
          + default_action = "Allow"
        }

        # (3 unchanged blocks hidden)
    }

  # module.sa.time_rotating.rotate will be created
  + resource "time_rotating" "rotate" {
      + day              = (known after apply)
      + hour             = (known after apply)
      + id               = (known after apply)
      + minute           = (known after apply)
      + month            = (known after apply)
      + rfc3339          = (known after apply)
      + rotation_days    = 360
      + rotation_rfc3339 = (known after apply)
      + second           = (known after apply)
      + unix             = (known after apply)
      + year             = (known after apply)
    }

  # module.sa.time_static.pim_expiry must be replaced
-/+ resource "time_static" "pim_expiry" {
      ~ day     = 7 -> (known after apply)
      ~ hour    = 10 -> (known after apply)
      ~ id      = "2025-11-07T10:54:35Z" -> (known after apply)
      ~ minute  = 54 -> (known after apply)
      ~ month   = 11 -> (known after apply)
      ~ rfc3339 = "2025-11-07T10:54:35Z" -> (known after apply) # forces replacement
      ~ second  = 35 -> (known after apply)
      ~ unix    = 1762512875 -> (known after apply)
      ~ year    = 2025 -> (known after apply)
    }

  # module.sa-migration-quarantine[0].time_rotating.rotate will be created
  + resource "time_rotating" "rotate" {
      + day              = (known after apply)
      + hour             = (known after apply)
      + id               = (known after apply)
      + minute           = (known after apply)
      + month            = (known after apply)
      + rfc3339          = (known after apply)
      + rotation_days    = 360
      + rotation_rfc3339 = (known after apply)
      + second           = (known after apply)
      + unix             = (known after apply)
      + year             = (known after apply)
    }

  # module.sa-migration-quarantine[0].time_static.pim_expiry must be replaced
-/+ resource "time_static" "pim_expiry" {
      ~ day     = 16 -> (known after apply)
      ~ hour    = 14 -> (known after apply)
      ~ id      = "2026-01-16T14:50:10Z" -> (known after apply)
      ~ minute  = 50 -> (known after apply)
      ~ month   = 1 -> (known after apply)
      ~ rfc3339 = "2026-01-16T14:50:10Z" -> (known after apply) # forces replacement
      ~ second  = 10 -> (known after apply)
      ~ unix    = 1768575010 -> (known after apply)
      ~ year    = 2026 -> (known after apply)
    }

  # module.sa-migration-standard[0].azurerm_storage_account.storage_account will be updated in-place
  ~ resource "azurerm_storage_account" "storage_account" {
        id                                 = "/subscriptions/5ca62022-6aa2-4cee-aaa7-e7536c8d566c/resourceGroups/darts-migration-prod-rg/providers/Microsoft.Storage/storageAccounts/saproddartsmig02"
        name                               = "saproddartsmig02"
        tags                               = {
            "application"         = "darts"
            "builtFrom"           = "https://github.com/HMCTS/darts-shared-infrastructure.git"
            "businessArea"        = "Cross-Cutting"
            "contactSlackChannel" = "#darts-devs"
            "environment"         = "production"
            "managedBy"           = "Darts Modernisation"
        }
        # (97 unchanged attributes hidden)

      + network_rules {
          + bypass         = [
              + "AzureServices",
            ]
          + default_action = "Allow"
        }

        # (3 unchanged blocks hidden)
    }

  # module.sa-migration-standard[0].time_rotating.rotate will be created
  + resource "time_rotating" "rotate" {
      + day              = (known after apply)
      + hour             = (known after apply)
      + id               = (known after apply)
      + minute           = (known after apply)
      + month            = (known after apply)
      + rfc3339          = (known after apply)
      + rotation_days    = 360
      + rotation_rfc3339 = (known after apply)
      + second           = (known after apply)
      + unix             = (known after apply)
      + year             = (known after apply)
    }

  # module.sa-migration-standard[0].time_static.pim_expiry must be replaced
-/+ resource "time_static" "pim_expiry" {
      ~ day     = 12 -> (known after apply)
      ~ hour    = 16 -> (known after apply)
      ~ id      = "2026-01-12T16:16:08Z" -> (known after apply)
      ~ minute  = 16 -> (known after apply)
      ~ month   = 1 -> (known after apply)
      ~ rfc3339 = "2026-01-12T16:16:08Z" -> (known after apply) # forces replacement
      ~ second  = 8 -> (known after apply)
      ~ unix    = 1768234568 -> (known after apply)
      ~ year    = 2026 -> (known after apply)
    }

Plan: 18 to add, 5 to change, 8 to destroy.
```

</details>


<details><summary>:information_source: Objects have changed outside of Terraform</summary>

_This feature was introduced from [Terraform v0.15.4](https://github.com/hashicorp/terraform/releases/tag/v0.15.4)._

```hcl

Terraform detected the following changes made outside of Terraform since the
last "terraform apply" which may have affected this plan:

  # module.sa.time_rotating.rotate has been deleted
  - resource "time_rotating" "rotate" {
        id               = "2024-11-12T10:54:35Z"
      - rotation_rfc3339 = "2025-11-07T10:54:35Z" -> null
        # (9 unchanged attributes hidden)
    }

  # module.sa-migration-quarantine[0].time_rotating.rotate has been deleted
  - resource "time_rotating" "rotate" {
        id               = "2025-01-21T14:50:10Z"
      - rotation_rfc3339 = "2026-01-16T14:50:10Z" -> null
        # (9 unchanged attributes hidden)
    }

  # module.sa-migration-standard[0].time_rotating.rotate has been deleted
  - resource "time_rotating" "rotate" {
        id               = "2025-01-17T16:16:08Z"
      - rotation_rfc3339 = "2026-01-12T16:16:08Z" -> null
        # (9 unchanged attributes hidden)
    }


Unless you have made equivalent changes to your configuration, or ignored the
```

</details>



<!-- github-comment: {"Command":"plan","PRNumber":375,"Program":"tfcmt","SHA1":"","Target":"prod","Vars":{}} -->